#n桁ある中で最小の素数一覧(18桁まで)
d = [2,
     11,
     101,
     1009,
     10007,
     100003,
     1000003,
     10000019,
     100000007,
     1000000007,
     10000000019,
     100000000003,
     1000000000039,
     10000000000037,
     100000000000031,
     1000000000000037,
     10000000000000061,
     100000000000000003
     ]

#n桁ある中で最大の素数
d = [7,
     97,
     997,
     9973,
     99991,
     999983,
     9999991,
     99999989,
     999999937,
     9999999967,
     99999999977,
     999999999989,
     9999999999971,
     99999999999973,
     999999999999989,
     9999999999999937,
     99999999999999997,
     999999999999999989
     ]

"""
#d1求めるコード
import math
def sosu(k):
    for i in range(2,math.isqrt(k)+1):
        if k % i == 0:
            return False
    return True
for N in range(1,19):
    for i in range(10**(N-1),10**N):
        if sosu(i):
            print(i)
            break
"""
"""
#d2求めるコード
import math
def sosu(k):
    for i in range(2,math.isqrt(k)+1):
        if k % i == 0:
            return False
    return True
for N in range(1,19):
    for i in range(10**N-1,10**(N-1),-1):
        if sosu(i):
            print(i)
            break
"""
